import './TermsTemplate.css';

export default function ServiceAgreement() {
  return (
    <div className="terms-container">
      <h2>📜 텔레파시 서비스 이용약관 동의 (필수)</h2>
      <p>
        공고일 : 2025.06.01
        <br />
        시험일 : 2025.06.01
      </p>
      <hr />

      <h3>제1조 [약관의 목적과 성립]</h3>
      <p>
        본 “서비스 약관(약관)”은 telepathy Telepathy(‘www.telepathy.com’이하 “제공자”)가 제공하는 서비스(이하 “서비스”)를 이용하고자 하는 개인(이하 "회원" 또는 "이용자")가  텔레파시 간 계약 관계에서 발생하는 권리와 의미, 그 범위에 필요한 기본 사항을 규정합니다.
      </p>

      <hr />
      <h3>제2조 [용어의 정의]</h3>
      <ul>
        <li><strong>이용자</strong>: 본 약관에 따른 서비스를 이용하는 모든 사람</li>
        <li><strong>제공자</strong>: 텔레파시 서비스를 제공하는 운영 조직</li>
        <li><strong>서비스</strong>: 회사가 운영하는 웹 기반 컨텐츠 관리 플랫폼</li>
        <li><strong>매칭</strong>: 단어 기반 또는 밸런스 게임을 통해 익명의 타인과 연결되는 행위</li>
        <li><strong>채팅:</strong> 매칭된 타 이용자와 정보를 주고 받는 행위</li>
        <li><strong>프리미엄 서비스</strong>: 추가 요금이 발생하거나, 특정 조건 충족 시 제공되는 부가 기능</li>
      </ul>

      <hr />
      <h3>제3조 [약관 동의]</h3>
      <ul>
        <li>이용자는 본 약관에 동의함으로써 제공자의 서비스 이용 권한을 가집니다.</li>
        <li>동의하지 않을 경우 서비스 이용이 제한됩니다.</li>
      </ul>

      <hr />
      <h3>제4조 [서비스의 제공 및 변경]</h3>
      <ul>
        <li>제공자는 이용자가 단어를 입력하거나 감정 선택을 통해 연결되는 커뮤니케이션 플랫폼을 제공합니다.</li>
        <li>제공자는 이용자가 매칭된 타 이용자와 채팅 서비스를 제공합니다.</li>
        <li>제공자 재량에 따라 서비스의 일부 또는 전부는 사전 공지 없이 변경될 수 있습니다.</li>
        <li>서비스와 관련해 발생하는 이용자의 어떠한 손해에 대해서도 제공자는 책임을 지지 않습니다.</li>
      </ul>


      <hr />
      <h3>제5조 [서비스 이용 제한]</h3>
      <p>
      다음과 같은 행위가 확인된 경우, 제공자는 이용자의 서비스 이용을 중단하거나 제한할 수 있습니다:
      </p>

      <ul>
        <li>비방, 음란, 혐오 등 부적절한 언어 입력</li>
        <li>자동화된 수단(봇 등)을 통한 접근 시도</li>
        <li>타인의 정보를 도용하거나 부정 사용</li>
        <li>그 외 기타 제공자가 판단하는 서비스의 운영을 방해하는 행위</li>
      </ul>

      <hr />
      <h3>제6조 [이용자의 권리와 의무]</h3>
      <ul>
        <li>이용자는 언제든지 서비스를 중단하거나 탈퇴할 수 있습니다.</li>
        <li>이용자는 서비스를 이용하는 과정에서 저작권 법 등 관련 법령을 위반하거나, 선량한 풍속, 기타 사회 질서에 반하는 행위를 하여서는 안됩니다.</li>
        <li>이용자의 서비스 접속 정보에 대한 관리 책임이 있으며, 이용자가 이에 대한 주의를 소홀히 하여 발생한 이용자 정보의 도용 및 이용자의 고객 개인 정보 이용 문제는 이용자에게 책임이 있습니다.</li>
        <li>이용자는 이 계약의 규정, 이용 안내 및 서비스와 관련하여 제공자로부터 통지받은 제반 사항과 합의된 내용을 준수하여야 합니다.</li>
        <li>이용자는 입력한 단어에 대해 모든 법적 책임을 가지며 서비스 이용 중 발생한 법령을 위반하는 모든 행위는 관련 법령에 의해 처벌됩니다.</li>
        <li>이용자는 채팅 중 발생한 법령 위반, 사회적 논란의 여지가 되는 행위에 대해 모든 민,형사상 책임을 가집니다.</li>
        <li>제공자는 이용자의 위법 행위로 인하여 발생한 모든 사건에 대해 관련 수사기관의 요청에 적극 협조합니다.</li>
      </ul>

      <hr />
      <h3>제7조 [개인정보 보호]</h3>
      <ul>
        <li>회사는 서비스 제공을 위해 개인정보를 수집하며, 이용자의 개인정보는 관련 법령에 따라 보호됩니다.</li>
        <li>자세한 사항은 개인정보처리방침에 따릅니다.</li>
      </ul>

      <hr />
      <h3>제8조 [면책조항]</h3>
      <p>
      제공자는 다음의 사유로 인하여 발생한 손해에 대하여는 책임을 면합니다.:
      </p>

      <ul>
        <li>어떠한 사유로 서비스 제공 장애 및 중단</li>
        <li>이용자의 고의 또는 과실로 인한 서비스의 중단, 장애 및 계약 해지의 경우</li>
        <li>이용자와 다른 이용자 간, 또는 이용자와 제 3자 간 발생한 분쟁</li>
        <li>본 약관의 허용범위를 벗어나 이용자가 서비스를 활용한 경우</li>
      </ul>

      
      <hr />
      <h3>제9조 [손해배상]</h3>
      <ul>
        <li>제공자는 상대방의 귀책에 따라 손해가 발생하는 경우 손해배상을 청구할 수 있습니다. 다만, 제공자는 무료서비스의 장애, 제공 중단, 보관된 자료 멸실 또는 삭제, 변조 등으로 인한 손해에 대하여는 배상책임을 부담하지 않습니다.</li>
        <li>제공자가 제공하는 서비스의 이용과 관련하여 제공자의 운영정책 및 개인 정보 보호정책, 기타 서비스별 이용약관에서 정하는 내용에 위반하지 않는 한 회사는 어떠한 손해에 대하여도 책임을 부담하지 않습니다.</li>
      </ul>

      <hr />
      <h3>제10조 [정보의 제공 및 광고의 게재]</h3>
      <ul>
        <li>제공자는 이용자가 서비스 이용 중 필요하다고 인정되는 각종 정보 및 광고를 배너 게재, 전자우편(E-Mail), 휴대폰 메세지, 전화, 우편 등의 방법으로 이용자에게 제공(또는 전송)할 수 있습니다. 다만, 이용자는 이를 원하지 않을 경우 제공자가 제공하는 방법에 따라 수신을 거부할 수 있습니다.</li>
        <li>제공자가 수신 거부를 한 경우에도 이용약관, 개인정보보호정책, 기타 이용자의 이익에 영향을 미칠 수 있는 중요한 사항의 변경 등 '정보통신망이용촉진 및 정보보호 등에 관한 법률'에서 정하는 사유 등 이용자가 반드시 알고 있어야 하는 사항에 대하여는 전자우편 등의 방법으로 정보를 제공할 수 있습니다.</li>
        <li>이용자가 수신 거부 조치를 취한 경우 이로 인하여 회사가 거래 관련 정보, 이용 문의에 대한 답변 등의 정보를 전달하지 못한 경우 회사는 이로 인한 책임이 없습니다.</li>
        <li>제공자는 광고주의 판촉 활동에 이용자가 참여하거나, 거래의 결과로서 발생하는 손실 또는 손해에 대하여는 책임을 지지 않습니다.</li>
      </ul>

      <hr />
      <h3>제11조 [권리의 귀속]</h3>
      <ul>
        <li>제공자가 제공하는 서비스에 대한  저작권 등 모든 지식재산권은 제공에 귀속 됩니다.</li>
        <li>제공자는 서비스와 관련하여 이용자에게 제공자가 정한 조건 따라 서비스를 이용할 수 있는 권한만을 부여하며, 제공자는 이를 양도, 판매, 담보제공 하는 등 처분행위를 할 수 없습니다.</li>
      </ul>

      <hr />
      <h3>제12조 [콘텐츠의 관리]</h3>
      <ul>
        <li>이용자가 서비스 이용 과정 중 매체를 통해 전송하는 콘텐츠가 '개인정보보호법' 및 '저작권법' 등 관련 법에 위반되는 내용을 포함하는 경우, 제공자는 관련 법이 정한 절차에 따라 해당 콘텐츠의 전송 중단 및 삭제 등의 조치를 취할 수 있으며, 제공자는 관련 법에 따라 조치를 취하여야 합니다.</li>
        <li>제공자는 전항에 따른 지식재산권 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사 정책 및 관련 법에 위반되는 경우에는 관련 법에 따라 해당 콘텐츠에 대해 임시 차단, 사용자 제재 등 조치를 취할 수 있습니다.</li>
      </ul>

      <hr />
      <h3>제13조 [분쟁해결 및 관할]</h3>
      <ul>
        <li>본 약관에 명시되지 않은 사항은 관련 법령 및 상관례에 따릅니다.</li>
        <li>분쟁 발생 시, 회사 소재지 관할 법원을 전속적 관할로 합니다.</li>
      </ul>

    </div>
  );
}
